{
  "08": {
    "company": "Wunderman Thompson Commerce",
    "office": "Watford (London))",
    "jobTitle": "Senior Frontend Developer",
    "isPresent": true,
    "startDate": "Dec 2019",
    "endDate": null,
    "description": "I involved in developing ecommerce websites using react/redux and integrating 3rd party APIs for reputed global brands like Tommy Hilfiger, Calvin Klein, DFS, Sainsbury’s, Halfords etc.",
    "achievements": [
      {
        "details": "Contributed frontend expertise in the development of products through the software life cycle, from requirements definition through successful deployment."
      },
      {
        "details": "Excelled in agile software development and management of technological issues, earning the highest customer satisfaction rating for all software solutions delivered."
      }
    ],
    "other": "Building component libraries, writing test cases and TDD, monitoring junior developers, pre and post deployment support and maintenance.",
    "misc": {
      "theme": "#00d1d9"
    }

  },
  "07": {
    "company": "Santander UK",
    "office": "Milton Keynes",
    "jobTitle": "Lead React Developer",
    "isPresent": false,
    "startDate": "Jul 2019",
    "endDate": "Dec 2019",
    "description": "I involved in a large banking project called \"Avalon\". Developed many frontend interfaces for banking clients using ReactJS and Redux.",
    "achievements": [
      {
        "details": "I introduced methodologies and best practices that enhanced product definition, release processes and customization of applications to user needs."
      }
    ],
    "other": "Building front end code base and libraries, writing test cases and TDD, team management, monitoring junior developers, post-sale support and maintenance.",
    "misc": {
      "theme": "#ff0000"
    }
  },
  "06": {
    "company": "Playtech Plc",
    "office": "Manchester",
    "jobTitle": "Senior Frontend Developer",
    "isPresent": false,
    "startDate": "Jul 2018",
    "endDate": "Jul 2019",
    "description": "I involved in many client faced apps development for gambling industries. AngularJS, Angular, ReactJS, TypeScript are few to name the technologies used to develop the apps.",
    "achievements": [
      {
        "details": "I developed a slot machine app prototype to tract players spending which later turned out to a full blown app – currently used in majority of the slot machines in the market."
      }
    ],
    "other": "Building front end shared components, testing, monitoring, support and maintenance.",
    "misc": {
      "theme": "#9c27b0"
    }
  },
  "05": {
    "company": "Intuitive Business Intelligence Ltd",
    "office": "Manchester",
    "jobTitle": "Software Developer",
    "isPresent": false,
    "startDate": "Nov 2013",
    "endDate": "Jun 2018",
    "description": "I worked on a project called \"Intuitive Dashboards\" - which is a data visualisation tool and I developed frontend (Single Page web Application) using cutting-edge technologies like JavaScript (VanillaJS, Kendo UI, BackboneJS, UnderscoreJS, RequireJS, jQuery, ReactJS), HTML5 and CSS3.",
    "achievements": [
      {
        "details": "I facilitated customization of Intuitive Dashboards by encouraging other developers to adopt emerging standards for web app development, architecture and tools."
      }
    ],
    "other": "Decoupling front-end from back end, prototyping, UI/UX design and development, testing, database management, client management, post-sale support and maintenance.",
    "misc": {
      "theme": "#61b8ff"
    }
  },
  "04": {
    "company": "ERS Connect",
    "office": "Glasgow",
    "jobTitle": "Software Developer",
    "isPresent": false,
    "startDate": "Sep 2012",
    "endDate": "Oct 2013",
    "description": "I assisted in design and development of Patient Appointment Confirmation Service and Telephone Answering Service application for NHS Trusts.",
    "achievements": [
      {
        "details": "I provided user requirements analysis, design and programming and fuelled additional revenue stream through responsive customer support."
      }
    ],
    "other": "Web site functionality and UI enhancement using, app development.",
    "misc": {
      "theme": "#76bb7f"
    }
  },
  "03": {
    "company": "CormSquare",
    "office": "India",
    "jobTitle": "Software Engineer",
    "isPresent": false,
    "startDate": "Jul 2009",
    "endDate": "Aug 2010",
    "description": "I worked on the project Customer Loyalty Solution. The former software application was targeted to small retailers. I was responsible for requirement analysis, impact analysis, application development using C# and testing, install and configuration, post-sale support and maintenance.",
    "achievements": [],
    "other": null,
    "misc": {
      "theme": "#000080"
    }
  },
  "02": {
    "company": "IBS Software",
    "office": "India",
    "jobTitle": "UI Design Intern",
    "isPresent": false,
    "startDate": "Jan 2009",
    "endDate": "Jun 2009",
    "description": "I worked on UI Design for developing Rich Internet Applications (m-RIA) framework and mobile applications. I was responsible for prototyping, pictographs, research on User Interface Design Process and Usability Standards.",
    "achievements": [],
    "other": null,
    "misc": {
      "theme": "#00FF00"
    }
  },
  "01": {
    "company": "TSS Ltd",
    "office": "India",
    "jobTitle": "Junior Networks Admin",
    "isPresent": false,
    "startDate": "Jul 2009",
    "endDate": "Aug 2010",
    "description": "I worked along with Network and Systems maintenance team to provide the best service, supported about 75 networked systems, phone systems in the organisation.",
    "achievements": [],
    "other": null,
    "misc": {
      "theme": "#000000"
    }
  }
}
